Dlubal.RFEM5.ISuperCombination
Interface for working with super combination

Dlubal.RFEM5.ISuperCombination.GetData
Gets super combination parameters.
Returns: Super combination parameters

Dlubal.RFEM5.ISuperCombination.SetData(System.UInt32@)
Sets super combination parameters.
Combination: Super combination parameters

Dlubal.RFEM5.ISuperCombination.Delete
Deletes super combination.

Dlubal.RFEM5.ISuperCombination.HasResults
Indicates that super combination has any results.
Returns: True if the super combination has any results, otherwise false.

Dlubal.RFEM5.ISuperCombination.GetQuadraticCombination
Gets quadratic combination parameters.
Returns: Quadratic combination parameters

Dlubal.RFEM5.ISuperCombination.SetQuadraticCombination(System.UInt32@)
Sets quadratic combination parameters.
Combination: Quadratic combination parameters

Dlubal.RFEM5.ISuperCombination.GetLoadings
Gets list of loadings in the super combination.
Returns: Array of loadings in the super combination.

Dlubal.RFEM5.ISuperCombination.SetLoadings(System.UInt32@)
Sets list of loadings in super combination.
Loadings: Array of loadings to be set in the super combination.